<?php 
/*
 *后台首页文件
 *author 王建 
 */
if (! defined('BASEPATH')) {
    exit('Access Denied');
}
header("Content-type: text/html; charset=utf-8"); 
class Admin extends MY_Controller {
	function Admin(){
		parent::__construct();
		$this->load->model('M_common');
		$this->load->model('m_zzb_dangzuzhi_guanli','guanli');
		$this->load->model('m_user','user');
		$this->load->model('m_zzb_dangzuzhi','dzz');
		$this->load->model('m_jzxh_shenqing','sq');
		$this->load->model('m_jzxh_baoming_yuyue','bm');
		$this->load->model('M_common_category_data', 'cd');//公用数据模型
	}
	//后台框架首页
	function index(){
		$list = $this->M_common->querylist("SELECT name,status,url from {$this->table_}common_admin_nav where pid = 0 and status = 1   order by disorder,id asc ");	
		$sql_login_log = "SELECT * FROM {$this->table_}common_adminloginlog WHERE username = '{$this->username}' order by id desc limit 2 " ;
		$login_info = $this->M_common->querylist($sql_login_log);
//		print_r($list);
		for($i=0;$i<count($list);$i++){
			if($list[$i]["url"]!=""){
				$arr = explode("/",$list[$i]["url"]);
				$isshow = $this->permition_for($arr[0],$arr[1]);//控制器 方法
			}
			else{
				$isshow = false;
			}
			$list[$i]["isshow"]=$isshow;
		}		
		$data = array(
			'list'=>$list,
			'username'=>$this->username,
			'group_name'=>"<font color='red'>".$this->group_name."</font>",
			'login_info'=>$login_info							
		);		
		$this->load->view(__TEMPLET_FOLDER__."/views_index",$data);
	}
	
	function get_shenqing_count(){
		echo $this->sq->count("check_status='0'");
		exit();
	}
	function get_baoming_count(){
		echo $this->bm->count("chuli_status='0'");
		exit();
	}
	
	function kaifa(){
        showmessage("功能开发中", site_url("swj_index/index"), 999999, 0);
        exit;	
	}
	//进行添加分类，将亚马逊的数据添加到数据库中
	/*function addClass() {
		$oneClass   =  array('Kindle 商店','Fire平板电脑','亚马逊海外购','图书','手机、摄影、数码',
					   '家居、厨具、家装','电脑、办公','家用电器','美妆、个护健康','食品、酒水、生鲜',
					   '玩具、母婴、家庭会员','运动户外','服装、鞋靴、箱包','钟表、首饰','汽车用品',
					   '游戏、影视、乐器');
		$twoClass   = array('1' => array('电子书阅读器','Kindle电子书','Kindle Unlimited','免费阅读软件'),
						'2' => array('Fire平板电脑','Kindle电子书','免费阅读软件'),
						'3' => array('母婴用品','玩具','服装服饰','鞋靴','皮具箱包','运动户外','美容化妆','个护健康','厨具','进口直采','海外购·闪购'),
						'4' => array('中文图书','进口图书','Kindle电子书','教材教辅','少儿','文学艺术','人文社科','经济管理','励志与成功','科技','生活'),
						'5' => array('手机通讯','智能生活馆','手机配件','数码影音','智能数码','摄影摄像','相机配件','乐器'),
						'6' => array('厨具','家纺','家具','生活日用','家居装饰','家居装修','宠物商店'),
						'7' => array('电脑整机','电脑外设','存储及电脑组件','网络用品','办公设备及耗材','办公及学生用品','电子教育','旗舰店'),
						'8' => array('电视/音响','大家电','厨房电器','居家电器','个护电器','旗舰店'),
						'9' => array('高端化妆品店','面部护肤','时尚彩妆','美发护发','身体护理','男士护理','香水精油','眼睛护理','日用清洁','保健用品','医疗器械','成人用品'),
						'10' => array('进口食品','酒水','牛奶饮料','冲调','休闲零食','粮油','保健食品','生鲜食品'),
						'11' => array('玩具','婴儿尿裤','奶粉','营养辅食','喂养洗护','童车','寝具家具','婴幼服装','妈妈用品','推荐品牌'),
						'12' => array('运动/户外服','背包/装备','智能穿戴','运动健身','大牌推荐','特色店铺'),
						'13' => array('服装服饰','鞋靴','皮具箱包','推荐品牌'),
						'14' => array('钟表','珠宝首饰'),
						'15' => array('车载电器','汽车装饰','美容养护','汽车配件','自驾装备'),
						'16' => array('游戏装备','游戏品牌','影视','音乐','乐器'),
						);
		$threeClass = array(
						'1' => array('1'=>array('Kindle','Kindle Paperwhite','Kindle Voyage','Kindle Oasis','Kindle配件'),
								'2'=>array('排行榜','特价书','进口原版','小说','经管','进口原版','文学','免费书','少儿','社科人文'),
								'3'=>array('包月电子书'),
								'4'=>array('安卓版','iPhone版','iPad版','PC版'),
								),
						'2' => array('1'=>array('全新Fire','Fire HD 7','Fire HDX','Fire HDX 8.9','Fire配件'),
								'2'=>array('排行榜','特价书','进口原版','小说','经管','进口原版','文学','免费书','少儿','社科人文'),
								'3'=>array('安卓版','iPhone版','iPad版','PC版'),
								),
						'3' => array('1'=>array('奶粉','喂养用品','安全防护','外出用品','童车推车'),
								'2'=>array('婴幼玩具','电子玩具','拼插玩具','动漫玩具'),
								'3'=>array('男装','女装','休闲装','内衣家居服','婴幼儿服'),
								'4'=>array('男鞋','女鞋','男童鞋','女童鞋'),
								'5'=>array('单肩包','钱包','双肩包','皮带'),
								'6'=>array('运动服饰','户外背包','健身训练','智能穿戴','跑步'),
								'7'=>array('面部护肤','彩妆','美发护发','身体护理','工具配件'),
								'8'=>array('眼睛护理','保健品','剃须用品','口腔护理'),
								'9'=>array('水具','酒具'),
								'10'=>array('食品','酒水','服饰箱包','鞋靴','珠宝首饰','数码影音'),
								'11'=>array('个护健康','母婴','小家电','美妆','服饰'),
								),
						'4' => array('1'=>array('教材教辅','少儿','文学','社科','经管'),
								'2'=>array("Children's Books",'Literature & Fiction','进口港台图书'),
								'3'=>array('小说','经管','文学','进口原版','社科','特价书','包月电子书'),
								'4'=>array('考试','外语学习','教材','中小学教辅','词典与工具书'),
								'5'=>array('0-2岁','3-6岁','7-10岁','11-14岁','儿童绘本','家庭教育'),
								'6'=>array('小说','文学','青春与动漫','传记','艺术'),
								'7'=>array('历史','国学古籍','哲学与宗教','法律','心理学'),
								'8'=>array('投资理财','管理','经济与金融','市场营销'),
								'9'=>array('心灵读物','人际交往','职场','成功学'),
								'10'=>array('科普','计算机与网络','医学','建筑'),
								'11'=>array('孕产育儿','烹饪与美食','健康与养生','旅游与地图'),
								),
						'5' => array('1'=>array('Apple iPhone','三星','诺基亚','华为','小米','联想','索尼','中兴','HTC','魅族','酷派','所有手机'),
								'2'=>array("智能家居",'智能健康','智能配饰','视听娱乐','中控','监控'),
								'3'=>array('移动电源','蓝牙/耳机','存储卡','保护壳','手机音箱','蓝牙配件'),
								'4'=>array('BOSE','Apple iPod','MP3/MP4','耳机/耳麦','音箱','高清播放器','录音笔','游戏设备','数码相框','收音机'),
								'5'=>array('可穿戴设备','智能手表','智能家居','娱乐影像','创意数码'),
								'6'=>array('便携相机','单反相机','单电/微单','镜头','数码摄像机','拍立得','运动相机及配件','相印机','监控安防','望远镜'),
								'7'=>array('摄影器材箱包','三脚架/云台','滤镜','自拍杆','闪光灯'),
								'8'=>array('电钢琴','电子琴','吉他','乐器配件','监听音箱','电鼓','原声钢琴'),
								),
						'6' => array('1'=>array('锅具/壶具','刀剪具','餐具','厨用小工具','厨房收纳','保鲜盒','水具','保温杯','茶具','咖啡用品','烘培用具','烧烤用具','酒具'),
								'2'=>array("床单件套",'被子','被套被罩','枕头','枕套枕巾','床褥','抱枕靠垫','毛巾浴巾','毯子','电热毯','蚊帐','凉席','窗帘','地毯'),
								'3'=>array('置物架','收纳柜','鞋柜','电脑桌','电脑椅','书柜书架','衣柜','床垫','沙发','电视柜','餐桌','椅凳','床','户外家具','儿童家具'),
								'4'=>array('收纳用品','清洁用品','浴室用品','缝纫','洗晒熨','雨伞','暖宝'),
								'5'=>array('布艺装饰','钟表','装饰画','照片墙/相框相册','摆件','花瓶/花艺'),
								'6'=>array('净水','工具','灯具','厨卫','园艺','电工','安防','口罩','滤水壶','五金','花洒','龙头','水槽','垃圾处理器','洁身器','墙纸/涂料'),
								'7'=>array('摄影器材箱包','三脚架/云台','滤镜','自拍杆','闪光灯'),
								'8'=>array('狗用品','猫用品','小宠用品','梳理美容','营养驱虫','猫狗窝'),
								),
						'7' => array('1'=>array('笔记本','超薄本','游戏本','台式机','一体机','软件'),
								'2'=>array("鼠标键盘",'显示器','耳麦','电脑包','摄像头','UPS电源','插座'),
								'3'=>array('固态硬盘','移动硬盘','U盘','存储卡','组装电脑','主板','显卡'),
								'4'=>array('路由器','网卡','网络存储','网络监控','交换机'),
								'5'=>array('投影机','会议演示','多功能一体机','打印机','办公耗材','数位板','电话机','扫描设备','碎纸机','考勤机','验钞机'),
								'6'=>array('书写工具','教具文具','笔记本','计算器','桌上用品','文档管理','文件装订','财务用品','办公家具','办公椅','礼品及摆件'),
								'7'=>array('早教益智','点读机/笔','电子辞典','学生平板','复读机'),
								'8'=>array('戴尔','Wacom手绘馆','XYZ3D打印','格之格','纽威尔'),
								),
						'8' => array('1'=>array('平板电视','迷你音响','投音机','家庭影院','功放','设备配件'),
								'2'=>array("洗衣机",'烘干机','热水器','烟灶套餐','油烟机','燃气灶','冰箱','冰柜','酒柜','空调','消毒柜','洗碗机'),
								'3'=>array('电饭煲','电压力锅','微波炉/光波炉','豆浆机','电磁炉','搅拌/榨汁机','面包机','电水壶/瓶','电烤箱','酸奶机','蒸/煮锅','电饼铛/三明治机','咖啡机','冰激凌机','豆芽机','烧烤炉'),
								'4'=>array('空气净化器','吸尘器','取暖器','加湿器','电风扇','电熨斗','挂烫机','饮水机','除湿机'),
								'5'=>array('电动剃须刀','电吹风','电动牙刷','电动理发器','电动剃毛器/脱毛器','耳鼻毛修剪器','电子秤','电动美容器','美发器','按摩器','足浴盆'),
								'6'=>array('北京国美电器'),
								),
						'9' => array('1'=>array('奢品护肤','香水','美发','身体沐浴','男士护理','彩妆及工具'),
								'2'=>array("洁面",'化妆水','精华','面霜乳液','面膜','眼霜','防晒','套装'),
								'3'=>array('面部','眼部','唇部','美甲','化妆工具','礼盒套装'),
								'4'=>array('洗发水','护发','洗护套装','染烫用品','头发造型','美发工具'),
								'5'=>array('沐浴','身体乳','脱毛','止汗香体','手足护理','精油香薰','套装'),
								'6'=>array('面部护理','洗发护发','剃须护理','身体护理','男士香水'),
								'7'=>array('女士香水','男士香水','香膏','礼盒套装'),
								'8'=>array('隐形眼镜','彩色隐形眼镜','护理液','太阳镜','老花镜','眼镜架'),
								'9'=>array('纸品','牙刷/牙膏','衣物清洁','卫生巾','家居清洁','驱蚊杀虫'),
								'10'=>array('按摩椅','口罩','按摩器械','保健护具'),
								'11'=>array('血压计','血糖仪','助听器','制氧机','中医保健','老年健康'),
								'12'=>array('安全避孕','情趣用品','润滑液','情趣服饰','私密护理','验孕测孕'),
								),
						'10' => array('1'=>array('牛奶','咖啡','糕点饼干','零食','意大利面','方便食品','橄榄油'),
								'2'=>array("白酒",'葡萄酒','洋酒','啤酒','日韩酒','海外酒庄直采'),
								'3'=>array('牛奶','果蔬饮料','饮用水','即饮咖啡'),
								'4'=>array('茶','麦片','奶粉','奶茶','蜂蜜','柚子茶','芝麻糊'),
								'5'=>array('巧克力','糖果','红枣','糕点饼干','干果','牛肉干','蜜饯'),
								'6'=>array('食用油','方便食品','调味品','杂粮','干货'),
								'7'=>array('维生素','蛋白粉','胶原蛋白','美容养颜','减肥瘦身','增强免疫'),
								'8'=>array('新鲜水果','新鲜蔬菜','海鲜水产','生肉禽蛋'),
								),
						'11' => array('1'=>array('婴幼','益智拼插','动漫','遥控','模型','拼图','运动户外','毛绒','0-12个月','1-3岁','4-6岁','7-12岁','12岁以上'),
								'2'=>array("NB/S",'M','L','XL','XXL','成长裤','布尿裤'),
								'3'=>array('1段','2段','3段','4段','孕产奶粉','特殊配方奶粉'),
								'4'=>array('米粉汤粥','饮品','DHA','钙铁锌','清火开胃','鱼油','肉松'),
								'5'=>array('奶瓶','奶嘴','餐具','洗浴','护肤','清洁','吸奶器','防溢乳垫'),
								'6'=>array('汽车安全座椅','婴儿推车','自行车','伞车'),
								'7'=>array('餐椅','睡袋','抱被','枕头枕套','隔尿垫','摇椅'),
								'8'=>array('内衣服饰','帽子/围巾/手套','服饰礼盒','背包箱子'),
								'9'=>array('孕妇装','产后塑身','内衣','背带','妈咪包','孕妈洗护'),
								'10'=>array('乐高','费雪','芭比','孩之宝','好奇','贝亲','美素'),
								),
						'12' => array('1'=>array('冲锋衣','三合一冲锋衣','冲锋裤','软壳','户外羽绒服','户外功能T','户外短裤','休闲T','休闲长裤','休闲短裤','套装'),
								'2'=>array("户外双肩",'户外单肩','休闲双肩','休闲单肩','腰包','球类装备包','滑雪包','跑步包','防水袋','帐篷','睡袋','水壶','望远镜'),
								'3'=>array('GPS运动腕表','计步器','骑行码表','铁人三项表'),
								'5'=>array('跑步服配','滑雪服配','瑜伽服配','健身器材','游泳服配','骑行','球类'),
								'4'=>array('MLB','大嘴猴','狼爪','北脸','Osprey','Gregory','JanSport','北极狐','Garmin','TomTom','Hummer','Speedo','Odlo','UVEX','Sunny Health'),
								'5'=>array('跑步馆','背包店','Ozark店','北脸店','Speedo店'),
								),
						'13' => array('1'=>array('女装','男装','童装','连衣裙','T恤/Polo衫','内衣','雪纺衫','半身裙','毛衣/针织衫','外套','休闲裤','衬衫','牛仔裤','帽衫/卫衣','围巾','太阳镜'),
								'2'=>array("女鞋",'男鞋','进口鞋','童鞋','专业运动鞋','休闲运动鞋','板鞋','帆布鞋','专业户外鞋','高跟鞋','单鞋','平底鞋','商务休闲鞋','正装鞋','靴子','时装靴','雪地靴','居家鞋'),
								'3'=>array('女包','男包','拉杆箱','双肩背包','单肩/斜挎包','钱包','电脑包','运动/户外包','皮带/皮具礼盒','旅行箱包','箱包国际精品馆'),
								'4'=>array('Ochirly','Nautica诺帝卡',"Levi's李维斯",'MANGO','American Tourister美旅','Clarks','Rockport乐步','le saunda莱尔斯丹','New Balance','Toread探路者','Vivienne Westwood','Rockland'),
								),
						'14' => array('1'=>array('男表','女表','机械表','情侣表','儿童表','石英表','钟','卡西欧','天梭','浪琴','欧米茄','斯沃琪','精工','汉米尔顿','美度','天王','海鸥','罗西尼','依波','颂拓','郎坤','飞亚达','ZStyle亚马逊尚品馆'),
								'2'=>array("黄金首饰",'银饰饰品','铂金饰品','钻石','手链/手镯','项链/吊坠','耳饰','男士饰品','头饰','流行饰品','天然水晶','天然玉石','珍珠饰品','戒指','胸针','碧玺','原木','进口首饰','施华洛世奇'),
								),
						'15' => array('1'=>array('GPS导航仪','行车记录仪','车载充电器','胎压检测','车载空气净化器'),
								'2'=>array('坐垫','座套','脚垫','汽车香水','挂件摆饰','后备箱垫','车载收纳用品','防爆膜'),
								'2'=>array("汽车油品",'洗车工具','车蜡','洗车液','皮革养护','轮胎养护'),
								'3'=>array("轮胎轮毂",'雨刷器','车灯','滤清器','迎宾脚踏板','防撞装饰条','车顶架','车衣/车罩','挡泥板','车牌框架','后视镜'),
								'4'=>array("摩托车头盔",'骑行护具','护目镜','儿童安全座椅','维修工具','安全应急设备','体感车'),
								),
						'16' => array('1'=>array('鼠标','键盘','耳机','手柄','方向盘','大屏投影','排行榜','DIY装备','特价折扣区'),
								'2'=>array("PlayStation 4",'Xbox One','雷蛇','罗技','Alienware','软件'),
								'3'=>array('电影','高清蓝光','纪录片','卡通动画','儿童影视','更多影视'),
								'4'=>array("流行",'进口CD','古典','儿童音乐','影音','更多音乐'),
								'5'=>array("电钢琴",'电子琴','吉他','乐器配件','监听音箱','电鼓','原声钢琴'),
								),
						);
	}*/
	function addClass() {
		$twoClass   = array('0' => '电子书阅读器',
							'1' => 'Kindle电子书',
							'2' => 'Kindle Unlimited',
							'3' => '免费阅读软件',
							'4' => 'Fire平板电脑',
							'5' => '母婴用品',
							'6' => '玩具',
							'7' => '服装服饰',
							'8' => '鞋靴',
							'9' => '皮具箱包',
							'10'=> '运动户外',
							'11'=> '美容化妆',
							'12'=> '个护健康',
							'13'=> '厨具',
							'14'=> '进口直采',
							'15'=>'海外购·闪购',
							'16'=>'中文图书',
							'17'=>'进口图书',
							'18'=>'教材教辅',
							'19'=>'少儿',
							'20'=>'文学艺术',
							'21'=>'人文社科',
							'22'=>'经济管理',
							'23'=>'励志与成功',
							'24'=>'科技',
							'25'=>'生活',
							'26'=>'手机通讯',
							'27'=>'智能生活馆',
							'28'=>'手机配件',
							'29'=>'数码影音',
							'30'=>'智能数码',
							'31'=>'摄影摄像',
							'32'=>'相机配件',
							'33'=>'乐器',
							'34'=>'厨具',
							'35'=>'家纺',
							'36'=>'家具',
							'37'=>'生活日用',
							'38'=>'家居装饰',
							'39'=>'家居装修',
							'40'=>'宠物商店',
							'41'=>'电脑整机',
							'42'=>'电脑外设',
							'43'=>'存储及电脑组件',
							'44'=>'网络用品',
							'45'=>'办公设备及耗材',
							'46'=>'办公及学生用品',
							'47'=>'电子教育',
							'48'=>'旗舰店',
							'49'=>'电视/音响',
							'50'=>'大家电',
							'51'=>'厨房电器',
							'52'=>'居家电器',
							'53'=>'个护电器',
							'54'=>'旗舰店',
							'55'=>'高端化妆品店',
							'56'=>'面部护肤',
							'57'=>'时尚彩妆',
							'58'=>'美发护发',
							'59'=>'身体护理',
							'60'=>'男士护理',
							'61'=>'香水精油',
							'62'=>'眼睛护理',
							'63'=>'日用清洁',
							'64'=>'保健用品',
							'65'=>'医疗器械',
							'66'=>'成人用品',
							'67'=>'进口食品',
							'68'=>'酒水',
							'69'=>'牛奶饮料',
							'70'=>'冲调',
							'71'=>'休闲零食',
							'72'=>'粮油',
							'73'=>'保健食品',
							'74'=>'生鲜食品',
							'75'=>'玩具',
							'76'=>'婴儿尿裤',
							'77'=>'奶粉',
							'78'=>'营养辅食',
							'79'=>'喂养洗护',
							'80'=>'童车',
							'81'=>'寝具家具',
							'82'=>'婴幼服装',
							'83'=>'妈妈用品',
							'84'=>'运动/户外服',
							'85'=>'背包/装备',
							'86'=>'智能穿戴',
							'87'=>'运动健身',
							'88'=>'特色店铺',
							'89'=>'服装服饰',
							'90'=>'鞋靴',
							'91'=>'皮具箱包',
							'92'=>'钟表',
							'93'=>'珠宝首饰',
							'94'=>'车载电器',
							'95'=>'汽车装饰',
							'96'=>'美容养护',
							'97'=>'汽车配件',
							'98'=>'自驾装备',
							'99'=>'游戏装备',
							'100'=>'影视',
							'101'=>'音乐',
							'102'=>'乐器'
						);
// var_dump($twoClass);exit;
		// echo count($twoClass);
		$threeClass = array(
						'0'=>array('Kindle','Kindle Paperwhite','Kindle Voyage','Kindle Oasis','Kindle配件'),
						'1'=>array('排行榜','特价书','进口原版','小说','经管','进口原版','文学','免费书','少儿','社科人文'),
						'2'=>array('包月电子书'),
						'3'=>array('安卓版','iPhone版','iPad版','PC版'),
						'4'=>array('全新Fire','Fire HD 7','Fire HDX','Fire HDX 8.9','Fire配件'),
						'5'=>array('奶粉','喂养用品','安全防护','外出用品','童车推车'),
						'6'=>array('婴幼玩具','电子玩具','拼插玩具','动漫玩具'),
						'7'=>array('男装','女装','休闲装','内衣家居服','婴幼儿服'),
						'8'=>array('男鞋','女鞋','男童鞋','女童鞋'),
						'9'=>array('单肩包','钱包','双肩包','皮带'),
						'10'=>array('运动服饰','户外背包','健身训练','智能穿戴','跑步'),
						'11'=>array('面部护肤','彩妆','美发护发','身体护理','工具配件'),
						'12'=>array('眼睛护理','保健品','剃须用品','口腔护理'),
						'13'=>array('水具','酒具'),
						'14'=>array('食品','酒水','服饰箱包','鞋靴','珠宝首饰','数码影音'),
						'15'=>array('个护健康','母婴','小家电','美妆','服饰'),
						'16'=>array('教材教辅','少儿','文学','社科','经管'),
						'17'=>array("Children's Books",'Literature & Fiction','进口港台图书'),
						'18'=>array('考试','外语学习','教材','中小学教辅','词典与工具书'),
						'19'=>array('0-2岁','3-6岁','7-10岁','11-14岁','儿童绘本','家庭教育'),
						'20'=>array('小说','文学','青春与动漫','传记','艺术'),
						'21'=>array('历史','国学古籍','哲学与宗教','法律','心理学'),
						'22'=>array('投资理财','管理','经济与金融','市场营销'),
						'23'=>array('心灵读物','人际交往','职场','成功学'),
						'24'=>array('科普','计算机与网络','医学','建筑'),
						'25'=>array('孕产育儿','烹饪与美食','健康与养生','旅游与地图'),
						'26'=>array("智能家居",'智能健康','智能配饰','视听娱乐','中控','监控'),
						'27'=>array('移动电源','蓝牙/耳机','存储卡','保护壳','手机音箱','蓝牙配件'),
						'28'=>array('BOSE','Apple iPod','MP3/MP4','耳机/耳麦','音箱','高清播放器','录音笔','游戏设备','数码相框','收音机'),
						'29'=>array('可穿戴设备','智能手表','智能家居','娱乐影像','创意数码'),
						'30'=>array('便携相机','单反相机','单电/微单','镜头','数码摄像机','拍立得','运动相机及配件','相印机','监控安防','望远镜'),
						'31'=>array('摄影器材箱包','三脚架/云台','滤镜','自拍杆','闪光灯'),
						'32'=>array('电钢琴','电子琴','吉他','乐器配件','监听音箱','电鼓','原声钢琴'),
						'33'=>array('锅具/壶具','刀剪具','餐具','厨用小工具','厨房收纳','保鲜盒','水具','保温杯','茶具','咖啡用品','烘培用具','烧烤用具','酒具'),
						'34'=>array("床单件套",'被子','被套被罩','枕头','枕套枕巾','床褥','抱枕靠垫','毛巾浴巾','毯子','电热毯','蚊帐','凉席','窗帘','地毯'),
						'35'=>array('置物架','收纳柜','鞋柜','电脑桌','电脑椅','书柜书架','衣柜','床垫','沙发','电视柜','餐桌','椅凳','床','户外家具','儿童家具'),
						'36'=>array('收纳用品','清洁用品','浴室用品','缝纫','洗晒熨','雨伞','暖宝'),
						'37'=>array('布艺装饰','钟表','装饰画','照片墙/相框相册','摆件','花瓶/花艺'),
						'38'=>array('净水','工具','灯具','厨卫','园艺','电工','安防','口罩','滤水壶','五金','花洒','龙头','水槽','垃圾处理器','洁身器','墙纸/涂料'),
						'39'=>array('摄影器材箱包','三脚架/云台','滤镜','自拍杆','闪光灯'),
						'40'=>array('狗用品','猫用品','小宠用品','梳理美容','营养驱虫','猫狗窝'),
						'41'=>array('笔记本','超薄本','游戏本','台式机','一体机','软件'),
						'42'=>array("鼠标键盘",'显示器','耳麦','电脑包','摄像头','UPS电源','插座'),
						'43'=>array('固态硬盘','移动硬盘','U盘','存储卡','组装电脑','主板','显卡'),
						'44'=>array('路由器','网卡','网络存储','网络监控','交换机'),
						'45'=>array('投影机','会议演示','多功能一体机','打印机','办公耗材','数位板','电话机','扫描设备','碎纸机','考勤机','验钞机'),
						'46'=>array('书写工具','教具文具','笔记本','计算器','桌上用品','文档管理','文件装订','财务用品','办公家具','办公椅','礼品及摆件'),
						'47'=>array('早教益智','点读机/笔','电子辞典','学生平板','复读机'),
						'48'=>array('戴尔','Wacom手绘馆','XYZ3D打印','格之格','纽威尔'),
						'49'=>array('平板电视','迷你音响','投音机','家庭影院','功放','设备配件'),
						'50'=>array("洗衣机",'烘干机','热水器','烟灶套餐','油烟机','燃气灶','冰箱','冰柜','酒柜','空调','消毒柜','洗碗机'),
						'51'=>array('电饭煲','电压力锅','微波炉/光波炉','豆浆机','电磁炉','搅拌/榨汁机','面包机','电水壶/瓶','电烤箱','酸奶机','蒸/煮锅','电饼铛/三明治机','咖啡机','冰激凌机','豆芽机','烧烤炉'),
						'52'=>array('空气净化器','吸尘器','取暖器','加湿器','电风扇','电熨斗','挂烫机','饮水机','除湿机'),
						'53'=>array('电动剃须刀','电吹风','电动牙刷','电动理发器','电动剃毛器/脱毛器','耳鼻毛修剪器','电子秤','电动美容器','美发器','按摩器','足浴盆'),
						'54'=>array('北京国美电器'),
						'55'=>array('奢品护肤','香水','美发','身体沐浴','男士护理','彩妆及工具'),
						'56'=>array("洁面",'化妆水','精华','面霜乳液','面膜','眼霜','防晒','套装'),
						'57'=>array('面部','眼部','唇部','美甲','化妆工具','礼盒套装'),
						'58'=>array('洗发水','护发','洗护套装','染烫用品','头发造型','美发工具'),
						'59'=>array('沐浴','身体乳','脱毛','止汗香体','手足护理','精油香薰','套装'),
						'60'=>array('面部护理','洗发护发','剃须护理','身体护理','男士香水'),
						'61'=>array('女士香水','男士香水','香膏','礼盒套装'),
						'62'=>array('隐形眼镜','彩色隐形眼镜','护理液','太阳镜','老花镜','眼镜架'),
						'63'=>array('纸品','牙刷/牙膏','衣物清洁','卫生巾','家居清洁','驱蚊杀虫'),
						'64'=>array('按摩椅','口罩','按摩器械','保健护具'),
						'65'=>array('血压计','血糖仪','助听器','制氧机','中医保健','老年健康'),
						'66'=>array('安全避孕','情趣用品','润滑液','情趣服饰','私密护理','验孕测孕'),
						'67'=>array('牛奶','咖啡','糕点饼干','零食','意大利面','方便食品','橄榄油'),
						'68'=>array("白酒",'葡萄酒','洋酒','啤酒','日韩酒','海外酒庄直采'),
						'69'=>array('牛奶','果蔬饮料','饮用水','即饮咖啡'),
						'70'=>array('茶','麦片','奶粉','奶茶','蜂蜜','柚子茶','芝麻糊'),
						'71'=>array('巧克力','糖果','红枣','糕点饼干','干果','牛肉干','蜜饯'),
						'72'=>array('食用油','方便食品','调味品','杂粮','干货'),
						'73'=>array('维生素','蛋白粉','胶原蛋白','美容养颜','减肥瘦身','增强免疫'),
						'74'=>array('新鲜水果','新鲜蔬菜','海鲜水产','生肉禽蛋'),
						'75'=>array('婴幼','益智拼插','动漫','遥控','模型','拼图','运动户外','毛绒','0-12个月','1-3岁','4-6岁','7-12岁','12岁以上'),
						'76'=>array("NB/S",'M','L','XL','XXL','成长裤','布尿裤'),
						'77'=>array('1段','2段','3段','4段','孕产奶粉','特殊配方奶粉'),
						'78'=>array('米粉汤粥','饮品','DHA','钙铁锌','清火开胃','鱼油','肉松'),
						'79'=>array('奶瓶','奶嘴','餐具','洗浴','护肤','清洁','吸奶器','防溢乳垫'),
						'80'=>array('汽车安全座椅','婴儿推车','自行车','伞车'),
						'81'=>array('餐椅','睡袋','抱被','枕头枕套','隔尿垫','摇椅'),
						'82'=>array('内衣服饰','帽子/围巾/手套','服饰礼盒','背包箱子'),
						'83'=>array('孕妇装','产后塑身','内衣','背带','妈咪包','孕妈洗护'),
						'84'=>array('冲锋衣','三合一冲锋衣','冲锋裤','软壳','户外羽绒服','户外功能T','户外短裤','休闲T','休闲长裤','休闲短裤','套装'),
						'85'=>array("户外双肩",'户外单肩','休闲双肩','休闲单肩','腰包','球类装备包','滑雪包','跑步包','防水袋','帐篷','睡袋','水壶','望远镜'),
						'86'=>array('GPS运动腕表','计步器','骑行码表','铁人三项表'),
						'87'=>array('跑步服配','滑雪服配','瑜伽服配','健身器材','游泳服配','骑行','球类'),
						'88'=>array('跑步馆','背包店','Ozark店','北脸店','Speedo店'),
						'89'=>array('女装','男装','童装','连衣裙','T恤/Polo衫','内衣','雪纺衫','半身裙','毛衣/针织衫','外套','休闲裤','衬衫','牛仔裤','帽衫/卫衣','围巾','太阳镜'),
						'90'=>array("女鞋",'男鞋','进口鞋','童鞋','专业运动鞋','休闲运动鞋','板鞋','帆布鞋','专业户外鞋','高跟鞋','单鞋','平底鞋','商务休闲鞋','正装鞋','靴子','时装靴','雪地靴','居家鞋'),
						'91'=>array('女包','男包','拉杆箱','双肩背包','单肩/斜挎包','钱包','电脑包','运动/户外包','皮带/皮具礼盒','旅行箱包','箱包国际精品馆'),
						'92'=>array('男表','女表','机械表','情侣表','儿童表','石英表','钟','卡西欧','天梭','浪琴','欧米茄','斯沃琪','精工','汉米尔顿','美度','天王','海鸥','罗西尼','依波','颂拓','郎坤','飞亚达','ZStyle亚马逊尚品馆'),
						'93'=>array("黄金首饰",'银饰饰品','铂金饰品','钻石','手链/手镯','项链/吊坠','耳饰','男士饰品','头饰','流行饰品','天然水晶','天然玉石','珍珠饰品','戒指','胸针','碧玺','原木','进口首饰','施华洛世奇'),
						'94'=>array('GPS导航仪','行车记录仪','车载充电器','胎压检测','车载空气净化器','汽车装饰'),
						'95'=>array('坐垫','座套','脚垫','汽车香水','挂件摆饰','后备箱垫','车载收纳用品','防爆膜'),
						'96'=>array("汽车油品",'洗车工具','车蜡','洗车液','皮革养护','轮胎养护'),
						'97'=>array("轮胎轮毂",'雨刷器','车灯','滤清器','迎宾脚踏板','防撞装饰条','车顶架','车衣/车罩','挡泥板','车牌框架','后视镜'),
						'98'=>array("摩托车头盔",'骑行护具','护目镜','儿童安全座椅','维修工具','安全应急设备','体感车'),
						'99'=>array('鼠标','键盘','耳机','手柄','方向盘','大屏投影','排行榜','DIY装备','特价折扣区'),
						'100'=>array('电影','高清蓝光','纪录片','卡通动画','儿童影视','更多影视'),
						'101'=>array("流行",'进口CD','古典','儿童音乐','影音','更多音乐'),
						'102'=>array("电钢琴",'电子琴','吉他','乐器配件','监听音箱','电鼓','原声钢琴')
						);
		foreach ($twoClass as $key => $value) {
			// echo $value.'<br/>';
			$pid = $this->doAddClass($value);//插入一级分类
			$this->doAddClass($threeClass[$key],$pid);//插入二级分类
		}
		// echo ','.count($threeClass);exit;
	}
	//添加商品分类,$pid上一级分类id，$item,插入的分类的名称,返回插入的id
	//$typeid = 11;//模型id,$typename = '基础资料';//公用数据名称
	private function doAddClass($item,$pid=45135,$typeid = 11,$typename='基础资料') {
		
		$status = '1';//开启
		if (is_array($item)) {//如果插入分类为数组时,多个分类
			$result = array();//返回插入的id数组
			foreach ($item as $key => $value) {
				$model = array('name' => $value,
						'pid' => $pid,
						'typeid' => $typeid,
						'typename' => $typename,
						'status' => $status
					);
				$data = $this->cd->Insert($model);//进行插入
				$result[] = $data['insert_id']?$data['insert_id']:'';
			}
			return $result;
		} else {//单个分类
			$model = array('name' => $item,
						'pid' => $pid,
						'typeid' => $typeid,
						'typename' => $typename,
						'status' => $status
					);
			$result = $this->cd->Insert($model);//进行插入
			return $result['insert_id']?$result['insert_id']:'';
		}
	}
}
